{
  "date": "2020-10-22T10:26:00.158Z",
  "img": "/img/goldimg.png",
  "title": "L'idée Compar'Or",
  "description": "Sortir de sa zone de confort : partir à l'aventure, combattre les bugs et rentrer victorieux ",
  "body": "Pendant la période de confinement, je me suis fixé comme objectif de créer une application web qui permettrait de « level-up » mes compétences en Javascript, et en architecture d'application en général.\n\nJ’ai donc lu plusieurs articles au sujet des bonnes idées de projets perso pour s’entrainer, élargir son portfolio de développeur web, et ainsi se créer des opportunités d’emploi. Sur la plupart des articles que j’ai consulté, les idées étaient les suivantes : créer une todo app, une app météo, un blog…\n\nCes projets, souvent accompagné d’une multitude de tutoriels, sont très utiles pour découvrir les divers facettes du développement web. Cependant, comme l'explique [Rayed Benbrahim](https://practicalprogramming.fr/author/rayed-benbrahim/) dans son article [\"Les tutos ne t’aident pas à progresser !](https://practicalprogramming.fr/pourquoi-les-tutos-ne-taident-pas/)\", il n’y a pas de magie, ni de raccourcis à prendre pour devenir développeur. \\\nLa seule solution est de travailler dur, et de faire face aux bugs comme Gandalf face au Balrog dans les mines de la Moria !\n\nMon objectif s’est alors précisé : je veux créer une app spécifique, sur mesure, avec mon API rien qu’à moi.  Pourquoi ? Simplement pour m’éloigner de toute aide trop accessible sur des projets aussi populaires, et ainsi me rapprocher au mieux du développement web en entreprise. Sortir de ma zone de confort avec comme seul support la documentation des technologies que j’utilise, et quelques forums sur les bugs rencontrés. \nQuelques jours après cette première réflexion, je suis tombé sur un article au sujet du webscraping que j’ai trouvé fort intéressant. En bref, le webscraping c'est une technique qui permet d’extraire les données d’un site en utilisant un script.  J’ai vite compris que cette méthode allait élargir grandement mes possibilités. En effet, au lieu d’utiliser une API public avec des données qui n’inspire pas ma créativité, j’avais maintenant le choix de créer la mienne avec des données ‘webscrapées’ !\n\nQuelques jours plus tard, mon oncle me contacte pour parler d’investissement sur le marché des métaux précieux et plus particulièrement sur le marché de l’or. Il finit par me demander de checker sur internet et de trouver le site avec les meilleurs offres de pièces d’or. Après recherche, je me rend compte que les prix varient d’un site à l’autre :  d’une vingtaine d'euros pour les 20 Francs Napoléon par exemple, et jusqu’à 200 euros de différence pour les pièces avec plus de valeur.\n\nFaire son choix est compliqué, on passe d'un onglet à l’autre, on compare les prix… De plus, certains sites ne sont pas très transparent : il faut demander un devis, chercher le prix de livraison, la prime, et calculer soi-même.  Je commence par perdre patience, je me rend donc sur Google pour trouver un bon comparateur de pièces d’or. Et là, rien ou presque : un site non maintenu, avec des prix non à jour. Ha ! Je venais tout juste de trouver l’idée pour mon projet : un comparateur de prix pièces d’or !  (et merci tonton :D)\n\nJe suis directement tombé sur la librairie ‘Puppeteer’ de l’équipe Google."
}