{
  "date": "2020-10-07T16:34:57.555Z",
  "title": "Mon nouveau projet (Fullstack JS)",
  "description": "Pendant la période de confinement je me suis fixé comme objectif de créer une application web...",
  "body": "Pendant la période de confinement je me suis fixé comme objectif de créer une application web qui permettrait de « level-up » mes compétences en Javascript, et en architecture d'application en général.\n\nJ’ai donc lu plusieurs articles au sujet des bonnes idées de sites pour s’entrainer, elargir son portfolio de devéloppeur web, et ainsi se créer des opportunités d’emplois. Sur la plupart des articles que j’ai consulté, les idées étaient les suivantes : créer une todo app, une app météo, un blog, une movie app avec l’API imdb, etc.\\\n« Ca ne m’interesse pas vraiment de créer un app générique comme celles-ci » me disait-je. Et effectivement, il y a au moins mille tutos sur Youtube pour chacune de ses idées. \n\n Mon objectif s’est alors precisé : je veux créer une app spécifique, sur mesure, avec mon API rien qu’à moi.  Pourquoi ? \\\nSimplement pour m’éloigner de toute aide trop accessible sur des projets aussi populaires, et ainsi me rapprocher au mieux du developpement web en entreprise.  Mes seuls supports seront la documentation des technologies que j’utilise, et quelques forums sur les bugs rencontrés.  Et si je venais à être bloqué totalement, j’ai toujours un compte sur le forum de StackOverflow et une communauté d’entraide de devs junior sur Discord, donc go go go ! Mais j’ai toujours pas d’idée !  Je m’appretais à utiliser l’API Spotify. Ou une autre qui listerait les produits bons pour la santé avec l’API Spoonacular. \n\nPeu de temps après cette première reflexion assez flou, je suis tombé sur un article au sujet du webscraping que j’ai trouvé fort intéressant. En bref, le webscraping c'est une technique qui permet d’extraire les données d’un site en utilisant un script.  J’ai vite compris que cette méthode allait élargir grandement mes possibilités. \\\nEn effet, au lieu d’utiliser une API public avec des données qui n’inspire pas ma créativité, j’avais maintenant le choix de créer la mienne avec des données webscrapées ! (alerte franglais détecté, alerte!)\n\n\nQuelques jours plus tard, mon oncle me contacte pour parler d’investissement sur le marché des métaux précieux et plus particulièrement sur le marché de l’or. Il finit par me demander de checker sur internet et de trouver le site avec les meilleurs offres de pièces d’or. Après recherche, je me rend compte que les prix varient d’un site à l’autre :  d’une vingtaine d'euros pour les 20 Francs Napoléon par exemple, et jusqu’à 200 euros de différence pour les pièces avec plus de valeur.\\\nFaire son choix est compliqué, on passe d'un onglet à l’autre, on compare les prix… De plus, certains sites ne sont pas très transparent : il faut demander un devis, chercher le prix de livraison, la prime, et calculer soi-même.  \\\nJe commence par perdre patience, je me rend donc sur google pour trouver un bon comparateur de pièces d’or. Et là, rien ou presque : un site qui date de 97 (j’abuse), tout cassé, avec des prix non à jour. \n\n Ha ! Je venais tout juste de trouver l’idée pour mon projet : un comparateur de prix pièces d’or !  (et merci tonton :D)\n\nJe suis directement tombé sur la librairie ‘Puppeteer’ de l’équipe Google.",
  "img": "/img/adobestock_173368401.jpeg"
}