{
  "date": "2020-04-30T22:56:35.524Z",
  "title": "Parlons de distraction digitale",
  "description": "Nous vivons une époque où la technologie est omniprésente dans nos vies, on a même parfois l'impression qu'elle l'encombre, n'est-ce pas ?",
  "img": "/img/minimalismiphone-min.jpg",
  "body": "Quand on veut devenir développeur en 2020, le savoir n'est pas ce qui manque : Internet nous livre les meilleurs formations et les questions à tous nos problèmes directement sur nos écrans. De ce point de vue, on a de la chance d'être née à une époque où tout est accessible en un clic.\n\nMaintenant, est-ce qu'on profite pleinement de cette connaissance ? Ou, est-ce qu'on se laisse trop souvent tenter par des \"outils\" qui attirent notre attention ? Qui fragmente notre concentration et qui souvent finissent par nous faire abandonner le projet ou le cours que l'on venait juste de commencer... ?\n\nUne notif Instagram - un mail - Reddit - un jeu vidéo - (TOU DOUM) NETFLIX !\n\nLa lecture du dernier livre de Cal Newport intitulé \"Digital Minimalism: Choosing a Focused Life in a Noisy World\" a changé mes habitudes quotidiennes. J'aimerai donc vous partager un résumé de ce qu'est le minimalisme digital dans le premier article de mon blog.\n\n\n\nL'auteur nous montre que la plupart des utilisateurs ont une approche maximaliste des nouvelles technologies : nous installons sans réfléchir, nous testons à peu près toutes les nouveautés, et meme pire, nous sommes mal à l'aise à l'idée de rater quelque chose. En effet, c'est paradoxal d'être en retard \"virtuellement\" dans un monde hyper-connecté... Alors nous y passons du temps : environ 2h par jour en moyenne en France. Chez les jeunes nées après 1997, c'est un peu moins de 4h par jour en moyenne sur leurs smartphones... (sans parler de confinement lol)\n\n\n\nCette approche m'a clairement fait perdre un temps fou et des opportunités en tout genre durant ma jeunesse et plus particulièrement pendant mes études. Le piège de cette philosophie maximaliste est de tomber dans une addiction. chacun de nos écrans se trouvent des ingenieurs ayant pour objectif de nous faire passer le plus de temps possible sur leur technologie, et ainsi gagner de l'argent sur notre propre attention. Cela peut paraître étonnant, mais le déclenchement de comportement addictifs est élaboré au plus haut niveau de la création d'une application. En d'autres termes, ils mettent en oeuvre des moyens subtils pour nous rendre accros.\n\n\n\n\"Les grands patrons des médias sociaux doivent cesser de se presenter comme d'aimables divinités intellos qui bâtissent un monde meilleur et admettre qu'ils ne sont que des producteurs de tabac en t-shirt qui vendent un produit addictif à des enfants. Parce que, il faut le voir en face, compter vos '\" j'aime\" est la nouvelle clope. »\n\n« Social Media is the New Nicotine | Real Time with Bill Maher (HBO) », vidéo YouTube, 4:54, mise en ligne le 12 mai 2017, <https://www.youtube.com/watch?v=KDqoTDM7tio>.\n\n\n\nL'auteur nous montre que nous avons une approche\n\nDès lors qu'une application peut nous sembler utile, on l'installe.Le problème c'est qu'elles ont toutes une utilité, aussi minime soit-elle... Dire oui à l'utilité dans ce domaine, c'est dire oui à tout l'App Store. Nous avons donc, inconsciemment, une approche numérique maximaliste."
}