{
  "date": "2020-04-30T22:56:35.524Z",
  "title": "Minimalisme digital",
  "description": "Nous vivons une époque où la technologie est omniprésente dans nos vies, on a même parfois l'impression qu'elle l'encombre, n'est-ce pas ?",
  "img": "/img/minimalismiphone-min.jpg",
  "body": "Quand on veut devenir développeur en 2020, le savoir n'est pas ce qui manque : Internet nous livre les meilleurs formations et les questions à tous nos problèmes directement sur nos écrans. De ce point de vue, on a de la chance d'être née à une époque où tout est accessible en un clic.\n\nMaintenant, est-ce qu'on profite pleinement de cette connaissance ? Ou, est-ce qu'on se laisse trop souvent tenter par des \"outils\" qui attirent notre attention ? Qui fragmentent notre concentration et qui, de fil en aiguilles, finissent par saboter notre motivation du jour, pourtant si importante...\n\nLa lecture du dernier livre de **Cal Newport** intitulé \"*Digital Minimalism: Choosing a Focused Life in a Noisy World*\" a changé mes habitudes quotidiennes. J'aimerai donc vous partager un résumé de ce qu'est le minimalisme digital dans le premier article de mon blog.\n\nL'auteur nous montre que la plupart des utilisateurs ont une approche maximaliste des nouvelles technologies : nous installons sans trop réfléchir, nous testons à peu près toutes les nouveautés, nous scrollons des fils d’actualités infinis, et même pire, nous sommes mal à l'aise à l'idée de rater quelque chose. C'est paradoxal d'être en retard \"virtuellement\" dans un monde hyper-connecté... Alors nous y passons du temps : environ 2h par jour en moyenne en France. Pour la \"génération Z\" (née après 1997), c'est un peu moins de 4h par jour en moyenne sur leurs smartphones. Sans prendre en compte le confinement qui a du faire flamber les stats. \n\n> ***\"Les grands patrons des médias sociaux doivent cesser de se présenter comme d'aimables divinités intellos qui bâtissent un monde meilleur et admettre qu'ils ne sont que des producteurs de tabac en t-shirt qui vendent un produit addictif à des enfants. Parce que, il faut le voir en face, compter vos \"j’aime\" est la nouvelle clope.* »***\n\nCette approche \"par défaut\" m'a clairement fait perdre un temps fou et des opportunités en tout genre durant ma jeunesse et plus particulièrement pendant mes études. Le piège de cette philosophie maximaliste est de tomber, vous l’aurez compris, dans une addiction. Addiction voulue et élaborée au plus haut niveau selon l’auteur, qui nous explique que derrière chacun de nos écrans se trouvent des ingénieurs, qui ont pour objectif de nous faire passer le plus de temps possible sur leur technologie, et ainsi gagner de l'argent grâce à notre propre attention. Ils connaissent leurs utilisateurs et mettent en œuvre des moyens subtils pour les rendre accrocs, à l’image de joueurs dans un casino, où l'insertion de pièces dans la machine à sous seraient remplacées par nos tapotements compulsifs sur l'écran, espérant un jour toucher le jackpot de \"like\".\n\n> ***\"Les internautes se livrent à un « jeu de hasard » chaque fois qu’ils publient quelque chose sur une plate-forme de médias sociaux : votre message obtiendra-t-il des « J’aime » (ou des petits cœurs, ou des retweets…), ou bien restera-t-il abandonné sans susciter de réaction ? Dans le premier cas, vous obtenez ce qu’un ingénieur de Facebook appelle « un tintement clair de pseudo-plaisir », dans le second cas, vous êtes déçu. Chaque fois, le résultat est difficilement prévisible, ce qui, nous enseigne la psychologie de l’addiction, rend l’activité entière de publication et de consultation follement attirante.\"***\n\n![illustration mobile with gamble and coins](/img/slotmobil-1-.jpg)\n\nL’approche proposée par l’auteur est un retour à l’autonomie par le minimalisme digital :\n\n*\"Philosophie de l’usage des technologies dans laquelle vous concentrez votre temps passé en ligne sur un petit nombre d’activités soigneusement choisies et optimisées, très propices à ce qui est important pour vous, et vous renoncez d’un cœur léger à tout le reste. »*\n\nPour appliquer cette philosophie, l’auteur nous conseille un plan en 3 étapes :\n\n1. Prévoir une période de 30 jours durant laquelle on désinstalle toutes applications optionnelles\n2. Explorer et redécouvrez des activités (sport, lecture, cuisine, bricolage, apprentissage en tout genre)\n3. Ré-installer les outils mis de coté, et en déterminer la valeur qu’elle apporte dans notre vie\n\nL’auteur est soft dans sa manière d’amener ses pensées : il ne dit pas qu’il faut tout supprimer, que tout est inutile ou ce genre de chose, l’idée est simplement de faire le tri entre ce qui est important et ce qui ne l’est pas. Et ainsi, d’utiliser le temps gagné pour s’attarder sur des passe-temps plus constructifs.\n\n(A noter que l’auteur englobe plusieurs domaines de la technologie dans son ouvrage, aussi bien Netflix et Youtube que les jeux-vidéo, même s’il se focus davantage sur les outils cités plus haut.)\n\nPour ma part, j’ai gardé Whatsapp et Linkedin pour communiquer, et Twitter pour faire une veille technologique sur les nouveautés dans le domaine du web. J'ai surtout ajouté 4 à 5h par jour d'apprentissage au développement web (avec des projets, et en concentration profonde, bien focus, contrairement à avant), une petite séance de footing le soir et de la lecture avant de dormir. Je me sens revivre et je vous invite à revivre avec moi !\n\nAu passage, j'ai dû suivre un tuto pour supprimer mon compte Instagram, haha. \n\nPour conclure, je vous conseillerai une application mobile pour justement ne plus le toucher (le mobile), hehe. L'application s'appelle \"Forest\", je vous laisse y jeter un oeil juste ici -> [Forest.app](https://www.forestapp.cc/)\n\n![forest-app](/img/forest-1-.png)\n\n*Social Media is the New Nicotine | Real Time with Bill Maher (HBO) », vidéo YouTube, 4:54, mise en ligne le 12 mai 2017, <https://www.youtube.com/watch?v=KDqoTDM7tio>.*\n\n*<https://www.bfmtv.com/tech/les-jeunes-francais-passent-pres-de-quatre-heures-par-jour-sur-leur-smartphone-1841068.html>*"
}